# Introduction to Pandas: Data Manipulation

It is often said that 80% of data analysis is spent on the data cleaning and preparing data. To get a handle on the problem, this section will focus on a small, nut important aspect of data manipulation and cleaning with pandas.

## Data Structure in Pandas

There are two different data structures are there in Pandas -

- Series : It is an one-dimensional labeled array of holding data of any data type (e.g. integer, string, floating point number, Python objects etc.). The axis are collectively referred to as the index.

- Data Frame : Is is a two-dimensional labeled data structure with columns of potentially different types. You can think of it as a SQL table or MS-Excel spreadsheets.

## Series Data Structure

<b>pandas.core.series.Series(data, index, dtype, copy)<b>
    
- data : Data for the Series from list or ndarray or dictionary or constants etc.
- index : It is unique and hashable for easy identification
- dtype : It is for data type
- copy : It only affects Series on ndarray data inputs

In [8]:
#importing required modules

import pandas as pd
import numpy as np

In [5]:
#creating empty Series

s = pd.Series()
print (s, len(s), type(s), id(s))

Series([], dtype: float64) 0 <class 'pandas.core.series.Series'> 2998051244304

C:\Users\dripp\AppData\Local\Temp\ipykernel_3896\485869926.py:3: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

In [9]:
#creating series from ndarray

my_data = np.array(['Amit','Kamal','Binay','Tuhin'])
print(my_data, type(my_data))

s = pd.Series(my_data)
print(s, type(my_data))

['Amit' 'Kamal' 'Binay' 'Tuhin'] <class 'numpy.ndarray'>
0     Amit
1    Kamal
2    Binay
3    Tuhin
dtype: object <class 'numpy.ndarray'>

In [13]:
arr1 = np.array([100, 200, 300, 400, 500])
print(arr1)

s = pd.Series(arr1)
print(s)

[100 200 300 400 500]
0    100
1    200
2    300
3    400
4    500
dtype: int32

In [17]:
arr1 = np.array([100, 200, 300, 400, 500])
print(arr1)
s = pd.Series(arr1, copy = False)
print (s)
s[0] = 999
arr1[1] = 888
print (arr1)
print (s)

[100 200 300 400 500]
0    100
1    200
2    300
3    400
4    500
dtype: int32
[999 888 300 400 500]
0    999
1    888
2    300
3    400
4    500
dtype: int32

In [19]:
#creating Series from ndarray

my_data = np.array(['Amit','Kamal','Binay','Tuhin'])
print (my_data)

s = pd.Series(my_data)
print (s)

['Amit' 'Kamal' 'Binay' 'Tuhin']
0     Amit
1    Kamal
2    Binay
3    Tuhin
dtype: object

In [22]:
#creating Series from ndarray

my_data = np.array(['Amit','Kamal','Binay','Tuhin'])
print (my_data)

s = pd.Series(my_data, index = [100,101,102,103])
print (s)
print (s[101])

['Amit' 'Kamal' 'Binay' 'Tuhin']
100     Amit
101    Kamal
102    Binay
103    Tuhin
dtype: object
Kamal

In [24]:
#creating Series from ndarray

my_data = np.array(['Amit','Kamal','Binay','Tuhin'])
print (my_data)

s = pd.Series(my_data, index = ['1st','2nd','3rd','4th'])
print (s)
print (s['1st'])
print (s[0])

['Amit' 'Kamal' 'Binay' 'Tuhin']
1st     Amit
2nd    Kamal
3rd    Binay
4th    Tuhin
dtype: object
Amit
Amit

In [28]:
# creating Series from ndarray
my_data = np.array(['Amit', 'Kamal', 'Binay', 'Tuhin'])
print (my_data, type(my_data))
s = pd.Series(data = my_data, index = ['1st', '2nd', '2nd', '3rd'])
print (s)
print (s['1st'])
print (s['2nd'])
print (s[2])

['Amit' 'Kamal' 'Binay' 'Tuhin'] <class 'numpy.ndarray'>
1st     Amit
2nd    Kamal
2nd    Binay
3rd    Tuhin
dtype: object
Amit
2nd    Kamal
2nd    Binay
dtype: object
Binay

In [32]:
# creating Series from dictionary

my_data = {'a':100, 'b':300, 'c':700, 'd':900, 'e':450}

print (my_data, type(my_data))

s = pd.Series(my_data)
print (s)

s = pd.Series(my_data, index = ['c', 'c', 'e', 'e', 'b', 'a', 'x'])
print (s)

{'a': 100, 'b': 300, 'c': 700, 'd': 900, 'e': 450} <class 'dict'>
a    100
b    300
c    700
d    900
e    450
dtype: int64
c    700.0
c    700.0
e    450.0
e    450.0
b    300.0
a    100.0
x      NaN
dtype: float64

In [34]:
#creating Series from a scalar or constant

s = pd.Series(5, index = [0, 1, 2, 3, 4])
print(s)

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [52]:
#creating series from a list

my_data = [11, 22, 33, 44, 55]
print (my_data, type(my_data))

s = pd.Series(my_data, index = ['a' , 'b' , 'c' , 'd' , 'e'])
print (s)
print (s['a'])
print (s[0])
print (s['b'] , s[2])
print (s['a':])

[11, 22, 33, 44, 55] <class 'list'>
a    11
b    22
c    33
d    44
e    55
dtype: int64
11
11
22 33
a    11
b    22
c    33
d    44
e    55
dtype: int64

# Data Frame Data Structure

In [14]:
my_data = {'emp_name':['Amal','Kamal','Binay'],
           'emp_age':[35, 45 , 55]}
print(my_data,type(my_data))

df = pd.DataFrame(data = my_data)
print (df)
df

{'emp_name': ['Amal', 'Kamal', 'Binay'], 'emp_age': [35, 45, 55]} <class 'dict'>
  emp_name  emp_age
0     Amal       35
1    Kamal       45
2    Binay       55

  emp_name  emp_age
0     Amal       35
1    Kamal       45
2    Binay       55

In [15]:
my_data = {'emp_name':['Amal','Kamal','Binay'],
           'emp_age':[35, 45 , 55]}
print(my_data,type(my_data))

emp_id = [1001 , 1002 , 1003]
df = pd.DataFrame(my_data, index = emp_id)
df

{'emp_name': ['Amal', 'Kamal', 'Binay'], 'emp_age': [35, 45, 55]} <class 'dict'>

     emp_name  emp_age
1001     Amal       35
1002    Kamal       45
1003    Binay       55

In [73]:
df = df.reset_index()
df

   index emp_name  emp_age
0   1001     Amal       35
1   1002    Kamal       45
2   1003    Binay       55

In [21]:
# converting data frame to ndarray

X = df[['emp_name', 'emp_age']]

print(X)    # Data Frame Removed (1D)

X           # Printing the Data Frame (2D)

Y = X.to_numpy()
print(Y , type(Y))

     emp_name  emp_age
1001     Amal       35
1002    Kamal       45
1003    Binay       55
[['Amal' 35]
 ['Kamal' 45]
 ['Binay' 55]] <class 'numpy.ndarray'>

In [27]:
var1 = 100
var2 = 200

print (var1)
var2            # print statement is not needed in the last statement

100

200

In [30]:
#creating new data frame for user 1

my_columns = ['name', 'age', 'gender', 'job']
my_input = [['alice', 19, 'F', 'student'], 
            ['john', 26, 'M', 'student']]

user1 = pd.DataFrame(my_input , columns = my_columns)
user1

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

In [31]:
#creating new data frame for user 2

my_columns = ['name', 'age', 'gender', 'job']
my_data = [['eric', 22, 'M', 'student'],
           ['paul', 58, 'F', 'manager']]
user2 = pd.DataFrame(my_data, columns = my_columns)
user2

   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager

In [33]:
#creating new data frame for user 3 from dictionary

my_dict = dict(name   =['peter', 'julie'], 
               age    =[33, 44], 
               gender =['M', 'F'], 
               job    =['engineer', 'scientist'])

print (my_dict)

user3 = pd.DataFrame(data = my_dict)
user3

{'name': ['peter', 'julie'], 'age': [33, 44], 'gender': ['M', 'F'], 'job': ['engineer', 'scientist']}

    name  age gender        job
0  peter   33      M   engineer
1  julie   44      F  scientist

## Concatenate Data Frame

In [41]:
#df = user1.append(user2)             #Both syntax can be used to concatenate the data frame
df = pd.concat([user1,user2])
df

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
0   eric   22      M  student
1   paul   58      F  manager

In [44]:
#df = user1.append(user2, ignore_index = True)
df = pd.concat([user1,user2],ignore_index = True)
df

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student
3   paul   58      F  manager

In [46]:
#users = pd.concat([user1, user2, user3])
users = pd.concat([user1, user2, user3], ignore_index = True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

## Join Data Frame

In [59]:
my_dict = dict(name = ['alice', 'john', 'eric', 'julie', 'michel'],
               height = [165 , 180 , 175 , 171 , 185])
user4 =  pd.DataFrame(my_dict)                                     #creating data frame for user4
user4

     name  height
0   alice     165
1    john     180
2    eric     175
3   julie     171
4  michel     185

In [60]:
# inner join:  only common records
merge_inner = pd.merge(users, user4, on = "name", how = "inner")
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [61]:
# outer join:  all records from both tables
merge_outer = pd.merge(users, user4, on = "name", how = "outer")
merge_outer

     name   age gender        job  height
0   alice  19.0      F    student   165.0
1    john  26.0      M    student   180.0
2    eric  22.0      M    student   175.0
3    paul  58.0      F    manager     NaN
4   peter  33.0      M   engineer     NaN
5   julie  44.0      F  scientist   171.0
6  michel   NaN    NaN        NaN   185.0

In [62]:
# left join:  all records from the left table and matching from the right table
merge_left = pd.merge(users, user4, on = "name", how = "left")
merge_left

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [63]:
# right join:  all records from the right table and matching from the left table
merge_right = pd.merge(users, user4, on = "name", how = "right")
merge_right

     name   age gender        job  height
0   alice  19.0      F    student     165
1    john  26.0      M    student     180
2    eric  22.0      M    student     175
3   julie  44.0      F  scientist     171
4  michel   NaN    NaN        NaN     185

In [64]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [65]:
print (type(users))

<class 'pandas.core.frame.DataFrame'>

In [70]:
users.head(3)     # printing from the top

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [69]:
users.tail(3)     # printing from the bottom

    name  age gender        job
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [71]:
users.sample(3)  # any randoms rows

    name  age gender       job
4  peter   33      M  engineer
1   john   26      M   student
2   eric   22      M   student

In [72]:
users.describe()

             age
count   6.000000
mean   33.666667
std    14.895189
min    19.000000
25%    23.000000
50%    29.500000
75%    41.250000
max    58.000000

In [73]:
users.describe(include = 'all')

         name        age gender      job
count       6   6.000000      6        6
unique      6        NaN      2        4
top     alice        NaN      F  student
freq        1        NaN      3        3
mean      NaN  33.666667    NaN      NaN
std       NaN  14.895189    NaN      NaN
min       NaN  19.000000    NaN      NaN
25%       NaN  23.000000    NaN      NaN
50%       NaN  29.500000    NaN      NaN
75%       NaN  41.250000    NaN      NaN
max       NaN  58.000000    NaN      NaN

In [74]:
users.describe(include = ['object'])

         name gender      job
count       6      6        6
unique      6      2        4
top     alice      F  student
freq        1      3        3

In [75]:
users.info()  #info about the users Data Frame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

## Columns Selection

In [76]:
print (users['gender'])

0    F
1    M
2    M
3    F
4    M
5    F
Name: gender, dtype: object

In [80]:
users[['gender' , 'age' , 'name']]

  gender  age   name
0      F   19  alice
1      M   26   john
2      M   22   eric
3      F   58   paul
4      M   33  peter
5      F   44  julie

In [81]:
my_cols = ['gender', 'age', 'name']
print (type(users[my_cols]))
users[my_cols]

<class 'pandas.core.frame.DataFrame'>

  gender  age   name
0      F   19  alice
1      M   26   john
2      M   22   eric
3      F   58   paul
4      M   33  peter
5      F   44  julie

## Rows Selection

In [84]:
df = users.copy()  #copying data of users to df
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [85]:
print (df.iloc[0])            #printing row no 1

name        alice
age            19
gender          F
job       student
Name: 0, dtype: object

In [86]:
print ()                    # for printing a blank line

In [87]:
print (df.loc[0])

name        alice
age            19
gender          F
job       student
Name: 0, dtype: object

In [88]:
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [98]:
print (df.iloc[4][3])
print (df.iloc[3]['job'])            # priting rows different syntax
print (df.loc[2, 'job'])
print (df.loc[3][3])

engineer
manager
student
manager

## Rows Selection and Filtering

In [102]:
print (users.age < 30)
print()
print()
users[users.age < 30]

0     True
1     True
2     True
3    False
4    False
5    False
Name: age, dtype: bool

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [103]:
bool_age = users.age < 30   #storing ages that are less than 30 in bool_age variable
print(bool_age)

0     True
1     True
2     True
3    False
4    False
5    False
Name: age, dtype: bool

In [104]:
users[bool_age]

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [105]:
users[bool_age].age          # printing age from users data frame which satisfies bool_age 
                             # i.g. age less than 30

0    19
1    26
2    22
Name: age, dtype: int64

In [109]:
users[bool_age][['age','name']]

   age   name
0   19  alice
1   26   john
2   22   eric

In [110]:
bool_age = (users.age >= 30) & (users.age <= 50)
print (bool_age)

print()

users[bool_age][['age', 'name']]

0    False
1    False
2    False
3    False
4     True
5     True
Name: age, dtype: bool

   age   name
4   33  peter
5   44  julie

In [111]:
users[users.job.isin(['student', 'engineer'])]

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

## Sorting